/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "Beim Erstellen eines neuen Albums ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Internetverbindung und versuchen Sie es später erneut.";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "Beim Hochladen eines Bildes zu den Picasa Web Alben ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Internetverbindung und versuchen Sie es später erneut.";

/* Could not create a new album */
"Could not create a new album" = "Neues Album konnte nicht erstellt werden";

/* Could not upload an image */
"Could not upload an image" = "Bild konnte nicht hochgeladen werden";
